backend/api/prisma/public/README.md
```mermaid
erDiagram
"Country" {
    String name "nullable"
    String cca3 PK
    String cca2 UK "nullable"
    String ccn3 UK "nullable"
    DayOfWeek startOfWeek "nullable"
    Region region "nullable"
    String subregion "nullable"
    String status "nullable"
    String flag "nullable"
    Float area "nullable"
    Int population "nullable"
    Boolean independent "nullable"
    Boolean unMember "nullable"
    Boolean landlocked "nullable"
    Json demonyms "nullable"
    Json maps "nullable"
    Json flags "nullable"
    Json car "nullable"
    Json coatOfArms "nullable"
    Json postalCode "nullable"
    String timezones
    String continents
    Float latlng
    String tld
    String altSpellings
    DateTime createdAt "nullable"
    DateTime updatedAt "nullable"
}
"CountryName" {
    String countryCode FK
    String languageCode FK
    String common "nullable"
    String official "nullable"
    Boolean native "nullable"
    DateTime createdAt "nullable"
    DateTime updatedAt "nullable"
}
"City" {
    Int id PK
    Boolean capital
    String city
    String state
    String countryCode FK
    Float latitude
    Float longitude
    DateTime createdAt "nullable"
    DateTime updatedAt "nullable"
}
"CallingCode" {
    String root
    String suffix
    String countryCode FK
    DateTime createdAt "nullable"
    DateTime updatedAt "nullable"
}
"Currency" {
    String code PK
    String name
    String symbol
    DateTime createdAt "nullable"
    DateTime updatedAt "nullable"
}
"CurrencyHistory" {
    String currencyCode FK
    DateTime date
    Float rate
    Int amount
    String base
    DateTime createdAt "nullable"
    DateTime updatedAt "nullable"
}
"CurrenciesInCountries" {
    String currencyCode FK
    String countryCode FK
    DateTime createdAt "nullable"
    DateTime updatedAt "nullable"
}
"Language" {
    String code PK
    String name
    Int category
    DateTime createdAt "nullable"
    DateTime updatedAt "nullable"
}
"LanguagesInCountries" {
    String languageCode FK
    String countryCode FK
    DateTime createdAt "nullable"
    DateTime updatedAt "nullable"
}
"Organization" {
    String code PK
    String name "nullable"
    DateTime createdAt "nullable"
    DateTime updatedAt "nullable"
}
"CountriesOnOrganizations" {
    String organizationCode FK
    String countryCode FK
    DateTime accession "nullable"
    DateTime withdrawal "nullable"
    DateTime createdAt "nullable"
    DateTime updatedAt "nullable"
}
"LicensePlate" {
    String code PK
    String name
    String group
    DateTime createdAt "nullable"
    DateTime updatedAt "nullable"
}
"EthnicGroup" {
    Int id PK
    String name
    String group
    DateTime createdAt "nullable"
    DateTime updatedAt "nullable"
}
"Stock" {
    String symbol PK
    String name
    Market market
    DateTime createdAt "nullable"
    DateTime updatedAt "nullable"
}
"StockHistory" {
    String symbol FK
    DateTime date
    Float open "nullable"
    Float high "nullable"
    Float low "nullable"
    Float close "nullable"
    Float volume "nullable"
    DateTime createdAt "nullable"
    DateTime updatedAt "nullable"
}
"TarotCard" {
    TarotCardType type
    String id PK
    String name "nullable"
    String value "nullable"
    Int valueInt "nullable"
    String suit "nullable"
    String meaningUp "nullable"
    String meaningReverse "nullable"
    String description "nullable"
    DateTime createdAt "nullable"
    DateTime updatedAt "nullable"
}
"NewsSource" {
    String id PK
    String name
    String description
    String url
    NewsSourceCategory category
    String language
    String country
}
"Word" {
    String word PK
    Json results "nullable"
    Json syllables "nullable"
    Json pronunciation "nullable"
    Float frequency "nullable"
    DateTime createdAt "nullable"
    DateTime updatedAt "nullable"
}
"TopLevelDomain" {
    String domain PK
    String type "nullable"
    DateTime createdAt "nullable"
    DateTime updatedAt "nullable"
}
"ProgrammingLanguage" {
    String language PK
    String color "nullable"
    ProgrammingLanguageType type
    String extensions
    String aliases
    String interpreters
    String filenames
    DateTime createdAt "nullable"
    DateTime updatedAt "nullable"
}
"License" {
    String id PK
    String name "nullable"
    String spdx "nullable"
    String node "nullable"
    String html "nullable"
    String description "nullable"
    String implementation "nullable"
    String body "nullable"
    String permissions
    String conditions
    String limitations
    DateTime createdAt "nullable"
    DateTime updatedAt "nullable"
}
"UnitedStatesCongress" {
    Int congress PK
    String houseControl "nullable"
    String senateControl "nullable"
    String congressControl "nullable"
    String trifectaControl "nullable"
    DateTime startDate "nullable"
    DateTime endDate "nullable"
    DateTime createdAt "nullable"
    DateTime updatedAt "nullable"
}
"UnitedStatesCongressMember" {
    String id PK
    String firstName "nullable"
    String middleName "nullable"
    String lastName "nullable"
    String suffix "nullable"
    DateTime dateOfBirth "nullable"
    String gender "nullable"
    DateTime createdAt "nullable"
    DateTime updatedAt "nullable"
    Int unitedStatesCongressCongress FK "nullable"
}
"UnitedStatesCongressMembersInCongresses" {
    UnitedStatesCongressChamber chamber
    Int congressNumber FK
    String memberId FK
    String title "nullable"
    String shortTitle "nullable"
    String party "nullable"
    String leadershipRole "nullable"
    Int seniority "nullable"
    String state "nullable"
    String district "nullable"
    Boolean atLarge "nullable"
    DateTime createdAt "nullable"
    DateTime updatedAt "nullable"
}
"UnitedStatesCongressCommittee" {
    UnitedStatesCongressChamber chamber
    Int congressNumber FK
    String id
    String name "nullable"
    String chairId FK "nullable"
    DateTime createdAt "nullable"
    DateTime updatedAt "nullable"
}
"Quote" {
    String id PK
    String author "nullable"
    String authorSlug "nullable"
    String content "nullable"
    String tags
    DateTime createdAt "nullable"
    DateTime updatedAt "nullable"
}
"University" {
    Int rank PK
    String university "nullable"
    String city "nullable"
    String countryCode FK "nullable"
    DateTime createdAt "nullable"
    DateTime updatedAt "nullable"
}
"CountryName" }o--|| "Country" : country
"CountryName" }o--|| "Language" : language
"City" }o--|| "Country" : country
"CallingCode" }o--|| "Country" : country
"CurrencyHistory" }o--|| "Currency" : currency
"CurrenciesInCountries" }o--|| "Currency" : currency
"CurrenciesInCountries" }o--|| "Country" : country
"LanguagesInCountries" }o--|| "Language" : language
"LanguagesInCountries" }o--|| "Country" : country
"CountriesOnOrganizations" }o--|| "Organization" : organization
"CountriesOnOrganizations" }o--|| "Country" : country
"StockHistory" }o--|| "Stock" : stock
"UnitedStatesCongressMember" }o--|| "UnitedStatesCongress" : UnitedStatesCongress
"UnitedStatesCongressMembersInCongresses" }o--|| "UnitedStatesCongress" : congress
"UnitedStatesCongressMembersInCongresses" }o--|| "UnitedStatesCongressMember" : member
"UnitedStatesCongressCommittee" }o--|| "UnitedStatesCongress" : congress
"UnitedStatesCongressCommittee" }o--|| "UnitedStatesCongressMember" : chair
"University" }o--|| "Country" : country
```
